In [1]:
import pandas as pd
school_data = "Resources/schools_complete.csv"
school_data_df=pd.read_csv(school_data)
student_data = "Resources/students_complete.csv"
student_data_df=pd.read_csv(student_data)

In [48]:
school_data_complete = pd.merge(student_data_df, school_data_df, how="left", on=["school_name", "school_name"])
school_data_complete.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [55]:
school_data_complete_df=school_data_complete[["grade","math_score","school_name"]]
grade_df=school_data_complete_df.groupby(["school_name"])
grade_df.mean()

                       math_score
school_name
Bailey High School      77.048432
Cabrera High School     83.061895
Figueroa High School    76.711767
Ford High School        77.102592
Griffin High School     83.351499
Hernandez High School   77.289752
Holden High School      83.803279
Huang High School       76.629414
Johnson High School     77.072464
Pena High School        83.839917
Rodriguez High School   76.842711
Shelton High School     83.359455
Thomas High School      83.418349
Wilson High School      83.274201
Wright High School      83.682222

In [39]:
nine_grades =school_data_complete_df[school_data_complete_df.grade == '9th']
nine_grades_df=nine_grades[["math_score","school_name"]]
ten_grades =school_data_complete_df[school_data_complete_df.grade == '10th']
ten_grades_df=ten_grades[["math_score","school_name"]]
eleven_grades =school_data_complete_df[school_data_complete_df.grade == '11th']
eleven_grades_df=eleven_grades[["math_score","school_name"]]
twelve_grades =school_data_complete_df[school_data_complete_df.grade == '12th']
twelve_grades_df=twelve_grades[["math_score","school_name"]]

In [45]:
school_df11=eleven_grades_df.groupby(["school_name"])
school_df11.mean()

                       math_score
school_name
Bailey High School      77.515588
Cabrera High School     82.765560
Figueroa High School    76.884344
Ford High School        76.918058
Griffin High School     83.842105
Hernandez High School   77.136029
Holden High School      85.000000
Huang High School       76.446602
Johnson High School     77.491653
Pena High School        84.328125
Rodriguez High School   76.395626
Shelton High School     83.383495
Thomas High School      83.498795
Wilson High School      83.195326
Wright High School      83.836782

In [44]:
school_df10=ten_grades_df.groupby(["school_name"])
school_df10.mean()

                       math_score
school_name
Bailey High School      76.996772
Cabrera High School     83.154506
Figueroa High School    76.539974
Ford High School        77.672316
Griffin High School     84.229064
Hernandez High School   77.337408
Holden High School      83.429825
Huang High School       75.908735
Johnson High School     76.691117
Pena High School        83.372000
Rodriguez High School   76.612500
Shelton High School     82.917411
Thomas High School      83.087886
Wilson High School      83.724422
Wright High School      84.010288

In [71]:
grade_df = school_data_complete_df.set_index("school_name")
# grade_df.loc[:, ["9th", "10th"]].head()
grade_df_groupyby(["school_name"]).mean()

NameError: name 'grade_df_groupyby' is not defined